target/classes/wsdl/wk/wk-artifact-resolve.wsdl

<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:tns="http://www.coi.gov.pl/login/ArtifactResolutionService" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" name="ArtifactResolutionService" targetNamespace="http://www.coi.gov.pl/login/ArtifactResolutionService">
    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:tns="http://www.coi.gov.pl/login/ArtifactResolutionService" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol">
            <xsd:import namespace="urn:oasis:names:tc:SAML:2.0:protocol" schemaLocation="https://int.login.gov.pl/login-services/idpArtifactResolutionService?xsd=saml/v2/saml-schema-protocol-2.0.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="artifactResponseMessage">
        <wsdl:part element="samlp:ArtifactResponse" name="artifactResponse"> </wsdl:part>
    </wsdl:message>
    <wsdl:message name="artifactResolveMessage">
        <wsdl:part element="samlp:ArtifactResolve" name="artifactResolve"> </wsdl:part>
    </wsdl:message>
    <wsdl:portType name="ArtifactResolutionServiceInterface">
        <wsdl:operation name="resolveArtifact">
            <wsdl:input message="tns:artifactResolveMessage" name="artifactResolveMessage"> </wsdl:input>
            <wsdl:output message="tns:artifactResponseMessage" name="artifactResponseMessage"> </wsdl:output>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="ArtifactResolutionServiceSoapBinding" type="tns:ArtifactResolutionServiceInterface">
        <wsaw:UsingAddressing xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" wsdl:required="false"/>
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="resolveArtifact">
            <soap:operation soapAction="" style="document"/>
            <wsdl:input name="artifactResolveMessage">
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output name="artifactResponseMessage">
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="ArtifactResolutionService">
        <wsdl:port binding="tns:ArtifactResolutionServiceSoapBinding" name="ArtifactResolutionServicePort">
            <soap:address location="https://int.login.gov.pl/login-services/idpArtifactResolutionService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>