distros/z/zxid/t/se-req2.xml

<soap:Envelope xmlns:lib="urn:liberty:iff:2003-08" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header></soap:Header><soap:Body><sp:ArtifactResolve xmlns:sp="urn:oasis:names:tc:SAML:2.0:protocol" ID="Rrcg8pXb8TxxnrNwFIw6n" IssueInstant="2006-05-19T00:49:41Z" Version="2.0"><sa:Issuer xmlns:sa="urn:oasis:names:tc:SAML:2.0:assertion" Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">https://cxp06.symlabs.com:7448/sp.xml</sa:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#Rrcg8pXb8TxxnrNwFIw6n"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>/lNIxs1CAdgyezcqpzVMrp8CwTE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>GeMp7LSWpani5sumy1Scgg7CDWMyHUTroOZdlqmM2Y3Uh3xqfYnOdsql2YyrhaX4CcSvVe7appDhBhcgaEsyVxVX4bhbJzYShXd97/ltB1ynUOKbRZ/bzIh5Lhksz3SENH3VKgOE/legERgLFPftTJCsHp74kPLwbyMLNbvnjn8=</ds:SignatureValue></ds:Signature><sp:Artifact>AAQAAUZB4mivMDKs73fx/GKA3jXyzobLQVJGQWpiRjVjc0tvbi1IOEdiN3A=</sp:Artifact></sp:ArtifactResolve></soap:Body></soap:Envelope>